In [1]:
!pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading mysql_connector_python-8.2.0-cp39-cp39-win_amd64.whl (14.2 MB)
Collecting protobuf<=4.21.12,>=4.21.1
  Downloading protobuf-4.21.12-cp39-cp39-win_amd64.whl (527 kB)
Installing collected packages: protobuf, mysql-connector-python
  Attempting uninstall: protobuf
    Found existing installation: protobuf 3.20.3
    Uninstalling protobuf-3.20.3:
      Successfully uninstalled protobuf-3.20.3
Successfully installed mysql-connector-python-8.2.0 protobuf-4.21.12

WARNING: Ignoring invalid distribution -rotobuf (c:\users\user\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -rotobuf (c:\users\user\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -rotobuf (c:\users\user\anaconda3\lib\site-packages)
    WARNING: Ignoring invalid distribution -rotobuf (c:\users\user\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -rotobuf (c:\users\user\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -rotobuf (c:\users\user\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -rotobuf (c:\users\user\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -rotobuf (c:\users\user\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -rotobuf (c:\users\user\anaconda3\lib\site-packages)

## Steps required:
1. Make a connection
2. Create a cursor
3. Run the queries using exceute

In [2]:
import mysql.connector

In [4]:
# Make a connection
mydb = mysql.connector.connect(host = 'localhost',
                               user = 'root',
                               password = '1234')

In [5]:
type(mydb)

mysql.connector.connection_cext.CMySQLConnection

In [6]:
# Create a cursor object
mycursor = mydb.cursor()

In [7]:
type(mycursor)

mysql.connector.cursor_cext.CMySQLCursor

--------------

In [8]:
# Run commands using the execute function
mycursor.execute('SHOW DATABASES')

In [9]:
list(mycursor)

[('demo',),
 ('demo1',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('world',)]

In [10]:
mycursor.execute('SHOW DATABASES')
for db in mycursor:
    print(db)

('demo',)
('demo1',)
('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('world',)

In [11]:
# creating a database
mycursor.execute('CREATE DATABASE demo2')

In [12]:
mycursor.execute('SHOW DATABASES')
for db in mycursor:
    print(db)

('demo',)
('demo1',)
('demo2',)
('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('world',)

In [13]:
# deleting a database
mycursor.execute('DROP DATABASE demo2')

In [14]:
mycursor.execute('SHOW DATABASES')
for db in mycursor:
    print(db)

('demo',)
('demo1',)
('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('world',)

In [15]:
mydb.commit()
mydb.close()

----
## Connecting with a database

In [16]:
mydb = mysql.connector.connect(host = 'localhost',
                               user = 'root',
                               password = '1234',
                               database = 'demo')
mycursor = mydb.cursor()

In [17]:
mycursor.execute('SHOW TABLES')
for table in mycursor:
    print(table)

('employee',)

In [18]:
mycursor.execute('DROP TABLE employee')

In [19]:
mycursor.execute('SHOW TABLES')
for table in mycursor:
    print(table)

In [20]:
query = '''CREATE TABLE employee(empid INT PRIMARY KEY, 
                                 name VARCHAR(100), 
                                 age INT, 
                                 city VARCHAR(100))'''
mycursor.execute(query)

In [21]:
mycursor.execute('SHOW TABLES')
for table in mycursor:
    print(table)

('employee',)

In [23]:
query = '''INSERT INTO employee(empid, name, age, city)
           VALUES (%s, %s, %s, %s)'''
val = (101, 'Abhay', 35, 'Delhi')
mycursor.execute(query, val)

In [24]:
mycursor.execute('SELECT * FROM employee')
for row in mycursor:
    print(row)

(101, 'Abhay', 35, 'Delhi')

In [25]:
empid = int(input('Enter employee id : '))
name = input('Enter the name : ')
age = int(input('Enter the age : '))
city = input('Enter the city : ')

val = (empid, name, age, city)
mycursor.execute(query, val)

Enter employee id : 102
Enter the name : Akash
Enter the age : 38
Enter the city : Hyderabad

In [26]:
mycursor.execute('SELECT * FROM employee')
for row in mycursor:
    print(row)

(101, 'Abhay', 35, 'Delhi')
(102, 'Akash', 38, 'Hyderabad')

In [28]:
query = '''INSERT INTO employee(empid, name, age, city)
           VALUES (%s, %s, %s, %s)'''

val = [(103, 'Akshay', 32, 'Chennai'),
       (104, 'Amit', 39, 'Jodhpur'),
       (105, 'Kamal', 42, 'Nagpur'),
       (106, 'Bhutnath', 55, 'Mumbai'),
       (107, 'Gabbar', 38, 'Jalore'),
       (108, 'Samba', 48, 'Dungarpur')]

mycursor.executemany(query, val)

In [29]:
mycursor.execute('SELECT * FROM employee')
for row in mycursor:
    print(row)

(101, 'Abhay', 35, 'Delhi')
(102, 'Akash', 38, 'Hyderabad')
(103, 'Akshay', 32, 'Chennai')
(104, 'Amit', 39, 'Jodhpur')
(105, 'Kamal', 42, 'Nagpur')
(106, 'Bhutnath', 55, 'Mumbai')
(107, 'Gabbar', 38, 'Jalore')
(108, 'Samba', 48, 'Dungarpur')

In [30]:
mycursor.execute('SELECT * FROM employee WHERE age > 40')
for row in mycursor:
    print(row)

(105, 'Kamal', 42, 'Nagpur')
(106, 'Bhutnath', 55, 'Mumbai')
(108, 'Samba', 48, 'Dungarpur')

In [33]:
mycursor.execute("SELECT * FROM employee WHERE city in ('Jaipur', 'Delhi', 'Mumbai')")
for row in mycursor:
    print(row)

(101, 'Abhay', 35, 'Delhi')
(106, 'Bhutnath', 55, 'Mumbai')

In [34]:
mydb.commit()
mydb.close()

-----
-----

In [35]:
mydb = mysql.connector.connect(host = 'localhost',
                               user = 'root',
                               password = '1234',
                               database = 'demo1')
mycursor = mydb.cursor()

In [36]:
mycursor.execute('SHOW TABLES')
for table in mycursor:
    print(table)

('department',)
('employee',)
('employee2',)

In [37]:
mycursor.execute('SELECT * FROM employee')
for row in mycursor:
    print(row)

(101, 'Akshita', 'BC', 'F', 'Delhi', 60000, 'Marketing')
(102, 'Ankit', 'Das', 'M', 'Kolkata', 80000, 'Finance')
(103, 'Ankita', 'Gangurde', 'F', 'Pune', 75000, 'Engineering')
(104, 'Ankur', 'Varshney', 'M', 'Gaziabad', 90000, 'Research')
(105, 'Utkarsh', 'Sharma', 'M', 'Jaipur', 400000, 'Research')
(106, 'Madhu', 'Bagri', 'F', 'Mumbai', 82000, 'Engineering')
(107, 'Mahtab', 'Alam', 'M', 'Hyderabad', 85000, 'Marketing')
(108, 'Tanya', 'Bajaj', 'F', 'Panipat', 80000, 'HR')
(109, 'Tarun', 'Shah', 'M', 'Jaipur', 75000, 'Finance')
(110, 'Rishabh', 'Sharma', 'M', 'Indore', 60000, 'HR')
(111, 'Rupa', 'Datta', 'F', 'Pune', 750000, 'Marketing')
(112, 'Uma', 'Dev', 'F', 'Hyderabad', 50000, 'Finance')
(113, 'Kumar', 'Sharma', 'M', 'Mumbai', 60000, 'Marketing')
(114, 'Naresh', 'Avasthi', 'M', 'Pune', 750000, 'Finance')
(115, 'Paul', 'Dave', 'M', 'Pune', 750000, 'Engineering')
(116, 'Kim', 'Yan', 'F', 'Mumbai', 30770, 'Marketing')
(117, 'Sam', 'Das', 'M', 'Jaipur', 22000, 'Management')
(118, 'Omy', 'Shah', 'F', 'Delhi', 45000, 'Finance')
(119, 'Tom', 'Fox', 'M', 'Kanpur', 150000, 'Finance')
(120, 'Jon', 'Cox', 'M', 'Mumbai', 24250, 'HR')
(121, 'Madhu', 'BG', 'F', 'Bangalore', 60000, 'R&D')
(122, 'Kirti', 'Binani', 'F', 'Kolkata', 55000, 'Finance')
(123, 'Govind', 'Chandak', 'M', 'Balasore', 80000, 'Engineering')
(124, 'Suman', 'Ch', 'F', 'Kolkata', 45000, 'Accounting')
(125, 'Bharat', 'Bag', 'M', 'Bangalore', 100000, 'Sales')
(126, 'Abhishek', 'Kumar', 'M', 'Hyderabad', 60000, 'Marketing')
(127, 'Mayank', 'Sharma', 'M', 'Delhi', 75000, 'Accounting')
(128, 'Shivangi', 'Shreya', 'F', 'Ranchi', 80000, 'Engineering')
(129, 'Rahul', 'Bhalotiya', 'M', 'Jamshedpur', 50000, 'Engineering')
(130, 'Dayanidhi', 'Dahima', 'M', 'Delhi', 90000, 'Sales')
(131, 'Avadhut', 'Madane', 'M', 'Pune', 20000, 'Finance')
(132, 'Rahul', 'Kokare', 'M', 'Baramati', 30000, 'Accounting')
(133, 'Suhas', 'Zunjar', 'M', 'Indapur', 35000, 'Marketing')
(134, 'Sanjay', 'Tangade', 'M', 'Solapur', 25000, 'HR')
(135, 'Vijay', 'Kokare', 'M', 'Sangali', 45000, 'R&D')
(136, 'Pallavi', 'Masetty', 'F', 'Hyderabad', 75000, 'Finance')
(137, 'Prasun', 'Kumar', 'M', 'Bangalore', 57000, 'Engineering')
(138, 'Kiran', 'Kumar', 'M', 'Hyderabad', 50000, 'Engineering')
(139, 'Arunava', 'Palai', 'M', 'Pune', 50000, 'HR')
(140, 'Ajay', 'Kudiya', 'M', 'Thane', 50000, 'IT')
(141, 'Priya', 'Dayalan', 'F', 'Kanchipuram', 25000, 'Finance')
(142, 'Pournima', 'Bhandare', 'F', 'Pune', 120000, 'Finance')
(143, 'Ashwanth', 'Kumar', 'M', 'Chennai', 48000, 'IT')
(144, 'Raghu', 'Nayak', 'M', 'Chennai', 80000, 'Accounting')
(145, 'Abhijeet', 'Kondpalle', 'M', 'Pune', 90000, 'Marketing')
(146, 'Sam', 'Pitroda', 'M', 'Hyderabad', 75000, 'Finance')
(147, 'Anitha', 'Krishnamaraju', 'F', 'Hyderabad', 100000, 'IT')
(148, 'Jyoti', 'Singh', 'F', 'Varanasi', 55000, 'IT')
(149, 'Abhay', 'Naik', 'M', 'Mumbai', 70000, 'HR')
(150, 'Mounika', 'Illa', 'F', 'Hyderabad', 60000, 'IT')

In [38]:
query = '''SELECT * FROM employee
           WHERE salary BETWEEN 80000 and 150000'''
mycursor.execute(query)
for row in mycursor:
    print(row)

(102, 'Ankit', 'Das', 'M', 'Kolkata', 80000, 'Finance')
(104, 'Ankur', 'Varshney', 'M', 'Gaziabad', 90000, 'Research')
(106, 'Madhu', 'Bagri', 'F', 'Mumbai', 82000, 'Engineering')
(107, 'Mahtab', 'Alam', 'M', 'Hyderabad', 85000, 'Marketing')
(108, 'Tanya', 'Bajaj', 'F', 'Panipat', 80000, 'HR')
(119, 'Tom', 'Fox', 'M', 'Kanpur', 150000, 'Finance')
(123, 'Govind', 'Chandak', 'M', 'Balasore', 80000, 'Engineering')
(125, 'Bharat', 'Bag', 'M', 'Bangalore', 100000, 'Sales')
(128, 'Shivangi', 'Shreya', 'F', 'Ranchi', 80000, 'Engineering')
(130, 'Dayanidhi', 'Dahima', 'M', 'Delhi', 90000, 'Sales')
(142, 'Pournima', 'Bhandare', 'F', 'Pune', 120000, 'Finance')
(144, 'Raghu', 'Nayak', 'M', 'Chennai', 80000, 'Accounting')
(145, 'Abhijeet', 'Kondpalle', 'M', 'Pune', 90000, 'Marketing')
(147, 'Anitha', 'Krishnamaraju', 'F', 'Hyderabad', 100000, 'IT')

In [39]:
query = '''SELECT * FROM employee
           WHERE salary BETWEEN 80000 and 150000
           ORDER BY salary DESC'''
mycursor.execute(query)
for row in mycursor:
    print(row)

(119, 'Tom', 'Fox', 'M', 'Kanpur', 150000, 'Finance')
(142, 'Pournima', 'Bhandare', 'F', 'Pune', 120000, 'Finance')
(125, 'Bharat', 'Bag', 'M', 'Bangalore', 100000, 'Sales')
(147, 'Anitha', 'Krishnamaraju', 'F', 'Hyderabad', 100000, 'IT')
(104, 'Ankur', 'Varshney', 'M', 'Gaziabad', 90000, 'Research')
(130, 'Dayanidhi', 'Dahima', 'M', 'Delhi', 90000, 'Sales')
(145, 'Abhijeet', 'Kondpalle', 'M', 'Pune', 90000, 'Marketing')
(107, 'Mahtab', 'Alam', 'M', 'Hyderabad', 85000, 'Marketing')
(106, 'Madhu', 'Bagri', 'F', 'Mumbai', 82000, 'Engineering')
(102, 'Ankit', 'Das', 'M', 'Kolkata', 80000, 'Finance')
(108, 'Tanya', 'Bajaj', 'F', 'Panipat', 80000, 'HR')
(123, 'Govind', 'Chandak', 'M', 'Balasore', 80000, 'Engineering')
(128, 'Shivangi', 'Shreya', 'F', 'Ranchi', 80000, 'Engineering')
(144, 'Raghu', 'Nayak', 'M', 'Chennai', 80000, 'Accounting')

In [40]:
query = '''SELECT department, AVG(salary) as avg_salary FROM employee
           GROUP BY department
           ORDER BY avg_salary DESC'''
mycursor.execute(query)
for row in mycursor:
    print(row)

('Research', Decimal('245000.0000'))
('Engineering', Decimal('153000.0000'))
('Marketing', Decimal('146346.2500'))
('Finance', Decimal('126666.6667'))
('Sales', Decimal('95000.0000'))
('IT', Decimal('62600.0000'))
('Accounting', Decimal('57500.0000'))
('R&D', Decimal('52500.0000'))
('HR', Decimal('51541.6667'))
('Management', Decimal('22000.0000'))

In [41]:
query = '''SELECT * FROM employee
           WHERE salary > (SELECT AVG(salary) FROM employee)'''
mycursor.execute(query)
for row in mycursor:
    print(row)

(105, 'Utkarsh', 'Sharma', 'M', 'Jaipur', 400000, 'Research')
(111, 'Rupa', 'Datta', 'F', 'Pune', 750000, 'Marketing')
(114, 'Naresh', 'Avasthi', 'M', 'Pune', 750000, 'Finance')
(115, 'Paul', 'Dave', 'M', 'Pune', 750000, 'Engineering')
(119, 'Tom', 'Fox', 'M', 'Kanpur', 150000, 'Finance')
(142, 'Pournima', 'Bhandare', 'F', 'Pune', 120000, 'Finance')

In [42]:
query = '''SELECT employee2.empid, employee2.empname, employee2.deptid, department.deptname, department.HOD
           FROM employee2 INNER JOIN department
           ON employee2.deptid = department.deptid'''
mycursor.execute(query)
for row in mycursor:
    print(row)

(1, 'Aman', 101, 'Marketing', 'Abhijeet')
(2, 'Anand', 104, 'Engineering', 'Muttuswamy')
(3, 'Vishal', 103, 'Research', 'Srinivas')
(4, 'Bhuvan', 101, 'Marketing', 'Abhijeet')
(5, 'Geetha', 103, 'Research', 'Srinivas')
(6, 'Shalini', 104, 'Engineering', 'Muttuswamy')